rspec/DojoSecrets/app/views/secrets/index.html.erb

    <p><%= secret.content %></p>
    <p><%= secret.likes.count %> likes</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]

  <% end %>
  <% if current_user.secrets_liked.exists?(secret.id) %>
---
SELECT  1 AS one FROM "secrets" INNER JOIN "likes" ON "secrets"."id" = "likes"."secret_id" WHERE "likes"."user_id" = $1 AND "secrets"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT "secrets".* FROM "secrets"