rspec/belt_reviewer/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(user: current_user, event: Event.find(params[:event_id]), content: params[:content])
    if @comment.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 9]]
INSERT INTO "comments" ("user_id", "event_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["event_id", 9], ["content", "NOOOOOO"], ["created_at", "2018-04-19 21:05:33.823475"], ["updated_at", "2018-04-19 21:05:33.823475"]]