rspec/belt_reviewer/app/controllers/events_controller.rb

  def index
    @user_state_events = Event.where("events.state = '#{current_user.state}'")
---
SELECT "events".* FROM "events" WHERE (events.state != 'AK')

  def create
    @event = Event.new(event_params)
    @event.state = params[:state]
    @event.user = current_user
    unless @event.save
---
INSERT INTO "events" ("name", "event_date", "location", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @event = Event.update(params[:event_id], event_params)
---
UPDATE "events" SET "state" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["state", "WY"], ["updated_at", "2018-04-19 19:32:35.949810"], ["id", 1]]

  def show
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @event = Event.find(params[:event_id])
    if @event.user.id == current_user.id
      @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]

  def attend
    Attendee.create(event: Event.find(params[:event_id]), user: User.find(current_user.id))
---
INSERT INTO "attendees" ("event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 2], ["user_id", 1], ["created_at", "2018-04-19 18:02:21.782852"], ["updated_at", "2018-04-19 18:02:21.782852"]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def cancel
    @attendee = Attendee.find_by(event_id: Event.find(params[:event_id]), user: User.find(current_user.id))
    @attendee.destroy
---
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."event_id" = 2 AND "attendees"."user_id" = 1 LIMIT 1
DELETE FROM "attendees" WHERE "attendees"."id" = ?  [["id", 6]]