rspec/belt_reviewer/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_email(session_params[:email]).try(:authenticate, session_params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "Admin"]]