rspec/belt_reviewer/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "location", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "jh@walkertexasranger.com"], ["updated_at", "2018-04-18 20:49:19.405387"], ["id", 1]]
---
  def update
    @user = User.update(current_user.id, edit_user_params)