rspec/DojoSecrets/app/views/users/show.html.erb


<% current_user.secrets.each do |secret| %>
---
SELECT "secrets".* FROM "secrets" WHERE "secrets"."user_id" = $1  [["user_id", 1]]