rspec/belt_reviewer/app/views/events/index.html.erb

        <td><%= event.location  %></td>
        <td><%= event.user.first_name  %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]