rspec/belt_reviewer/app/views/events/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "comments" ON "users"."comment_id" = "comments"."id" WHERE "comments"."event_id" = ?  [["event_id", 9]]
---
<div style="overflow: auto; width:300px; height:200px;">
    <% @event.comments.each do |comment| %>
        <p><%= comment.user.first_name %> says: <%= comment.content %></p>