rspec/DojoSecrets/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "secret_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["secret_id", 3], ["created_at", "2018-04-16 22:25:19.647480"], ["updated_at", "2018-04-16 22:25:19.647480"]]
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 3]]
---
  def create
    Like.create(user: current_user, secret: Secret.find(params[:secret_id]))

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = 738 AND "likes"."secret_id" = 370 LIMIT 1
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 335]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 3]]
---
  def destroy
    @like = Like.where("likes.user_id = #{current_user.id} AND likes.secret_id = #{params[:secret_id]}")
    @like[0].destroy