rspec/DojoSecrets/app/controllers/secrets_controller.rb

  def index
    @secrets = Secret.all
---
SELECT "secrets".* FROM "secrets"

  def create
    @secret = Secret.new
    @secret.content = params[:secret][:content]
    @secret.user = current_user
    unless @secret.save
---
INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "My new secret"], ["user_id", 8], ["created_at", "2018-04-16 22:25:19.908271"], ["updated_at", "2018-04-16 22:25:19.908271"]]

  def destroy
    @secret = Secret.find(params[:secret_id])
    if @secret.user == current_user
      @secret.destroy
---
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 10]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 10]]