rspec/DojoSecrets/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 29]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Another Name"], ["email", "correct@email.com"], ["updated_at", "2018-04-16 22:25:20.654334"], ["id", 30]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_edit_params)